from typing import cast, Union

__all__ = ['get_data']

_bl_ver: tuple[int, int, int] = None

A = 0
Z = 99
_3__0__X_ = (3, 0, Z)
_3__1__X_ = (3, 1, Z)
_3__2__X_ = (3, 2, Z)
_3__3__X_ = (3, 3, Z)
_3__4__X_ = (3, 4, Z)
_3__5__X_ = (3, 5, Z)
_3__6__X_ = (3, 6, Z)
_4__0__X_ = (4, 0, Z)
_4__1__X_ = (4, 1, Z)
_4__2__X_ = (4, 2, Z)
_4__3__X_ = (4, 3, Z)
_4__4__X_ = (4, 4, Z)
_4__5__X_ = (4, 5, Z)
_5__0__X_ = (5, 0, Z)
_latest__ = _5__1__X_ = (5, 1, Z)

def MAP(items: dict, item_name: str, maps: list[tuple[tuple[int, int, int], tuple[int, int, int], int]]):
    # 允许使用未适配的 Blender 版本
    __bl_ver = _bl_ver if _bl_ver <= _latest__ else _latest__

    for map in maps:
        # map[0] - 最小版本号
        # map[1] - 最大版本号
        # map[2] - 值
        if map[0] <= __bl_ver <= map[1]:
            items[item_name] = map[2]
            return

def get_data(bl_ver: tuple[int, int, int]) -> Union[dict, None]:
    global _bl_ver
    _bl_ver = bl_ver

    data = {
        # 当前数据适用 Blender 版本范围
        'blender_vers': [
            ((3, 0, 0), _5__1__X_),
        ],
        'items': {},
    }

    items = cast(dict[str, int], data['items'])

    items['offset_ListBase__first'] = 0
    items['offset_ListBase__last'] = 8
    items['offset_Link__next'] = 0
    items['offset_Link__prev'] = 8

    # DNA 类型 wmWindow

    MAP(items, 'offset_wmWindow__modalhandlers', [
        ((3, 0, 0), _3__2__X_, 272),
        ((3, 3, 0), _3__4__X_, 280),
        ((3, 5, 0), _3__6__X_, 296),
        ((4, 0, 0), _4__0__X_, 296),
        ((4, 1, 0), _4__4__X_, 304),
        ((4, 5, 0), _4__5__X_, 280),
        ((5, 0, 0), _5__0__X_, 280),
    ])

    # 从 Blender 5.1.0 开始需要这些参数：
    # - offset_wmWindow__runtime
    # - offset_WindowRuntime__ghostwin
    # - offset_WindowRuntime__modalhandlers

    MAP(items, 'offset_wmWindow__runtime', [
        ((5, 1, 0), _5__1__X_, 240),
    ])

    MAP(items, 'offset_WindowRuntime__ghostwin', [
        ((5, 1, 0), _5__1__X_, 32),
    ])

    MAP(items, 'offset_WindowRuntime__modalhandlers', [
        ((5, 1, 0), _5__1__X_, 64),
    ])

    MAP(items, 'offset_wmWindow__workspace_hook', [
        ((3, 0, 0), _3__2__X_, 120),
        ((3, 3, 0), _3__4__X_, 128),
        ((3, 5, 0), _3__6__X_, 128),
        ((4, 0, 0), _4__0__X_, 128),
        ((4, 1, 0), _4__4__X_, 128),
        ((4, 5, 0), _4__5__X_, 128),
        ((5, 0, 0), _5__0__X_, 128),
        ((5, 1, 0), _5__1__X_, 112),
    ])

    # DNA 类型 WorkSpaceInstanceHook

    MAP(items, 'offset_WorkSpaceInstanceHook__active', [
        ((3, 0, 0), _3__6__X_, 0),
        ((4, 0, 0), _4__4__X_, 0),
        ((4, 5, 0), _4__5__X_, 0),
        ((5, 0, 0), _5__0__X_, 0),
        ((5, 1, 0), _5__1__X_, 0),
    ])

    MAP(items, 'offset_WorkSpaceInstanceHook__act_layout', [
        ((3, 0, 0), _3__6__X_, 8),
        ((4, 0, 0), _4__4__X_, 8),
        ((4, 5, 0), _4__5__X_, 8),
        ((5, 0, 0), _5__0__X_, 8),
        ((5, 1, 0), _5__1__X_, 8),
    ])

    # DNA 类型 WorkSpaceLayout

    MAP(items, 'offset_WorkSpaceLayout__screen', [
        ((3, 0, 0), _3__6__X_, 16),
        ((4, 0, 0), _4__4__X_, 16),
        ((4, 5, 0), _4__5__X_, 16),
        ((5, 0, 0), _5__0__X_, 16),
        ((5, 1, 0), _5__1__X_, 16),
    ])

    # DNA 类型 bScreen

    MAP(items, 'offset_bScreen__active_region', [
        ((3, 0, 0), _3__6__X_, 280),
        ((4, 0, 0), _4__4__X_, 280),
        ((4, 5, 0), _4__5__X_, 312),
        ((5, 0, 0), _5__0__X_, 496),
        ((5, 1, 0), _5__1__X_, 496),
    ])

    # DNA 类型 ARegion (3.0 - 4.3)

    MAP(items, 'offset_ARegion__uiblocks', [
        ((3, 0, 0), _3__5__X_, 232),
        ((3, 6, 0), _3__6__X_, 240),
        ((4, 0, 0), _4__3__X_, 240),
    ])

    # DNA 类型 ARegion

    # 从 Blender 4.4.0 开始需要这些参数：
    # - offset_ARegion__runtime
    # - offset_ARegionRuntime__uiblocks

    MAP(items, 'offset_ARegion__runtime', [
        ((4, 4, 0), _4__4__X_, 296),
        ((4, 5, 0), _4__5__X_, 296),
        ((5, 0, 0), _5__0__X_, 296),
        ((5, 1, 0), _5__1__X_, 296),
    ])

    # 注意：Release 配置下的偏移量和 Debug 配置下的不同
    MAP(items, 'offset_ARegionRuntime__uiblocks', [
        ((4, 4, 0), _4__4__X_, 496),
        ((4, 5, 0), _4__5__X_, 488),
        ((5, 0, 0), _5__0__X_, 488),
        ((5, 1, 0), _5__1__X_, 488),
    ])

    # 非 DNA 类型 wmEventHandler、wmEventHandler_UI

    MAP(items, 'offset_wmEventHandler__type', [
        ((3, 0, 0), _3__4__X_, 16),
        ((3, 5, 0), _3__6__X_, 16),
        ((4, 0, 0), _4__4__X_, 16),
        ((4, 5, 0), _4__5__X_, 16),
        ((5, 0, 0), _5__0__X_, 16),
        ((5, 1, 0), _5__1__X_, 16),
    ])
    MAP(items, 'offset_wmEventHandler__handle_fn', [
        ((3, 0, 0), _3__4__X_, 32),
        ((3, 5, 0), _3__6__X_, 32),
        ((4, 0, 0), _4__4__X_, 32),
        ((4, 5, 0), _4__5__X_, 32),
        ((5, 0, 0), _5__0__X_, 32),
        ((5, 1, 0), _5__1__X_, 32),
    ])
    MAP(items, 'offset_wmEventHandler__remove_fn', [
        ((3, 0, 0), _3__4__X_, 40),
        ((3, 5, 0), _3__6__X_, 40),
        ((4, 0, 0), _4__4__X_, 40),
        ((4, 5, 0), _4__5__X_, 40),
        ((5, 0, 0), _5__0__X_, 40),
        ((5, 1, 0), _5__1__X_, 40),
    ])
    MAP(items, 'offset_wmEventHandler__user_data', [
        ((3, 0, 0), _3__4__X_, 48),
        ((3, 5, 0), _3__6__X_, 48),
        ((4, 0, 0), _4__4__X_, 48),
        ((4, 5, 0), _4__5__X_, 48),
        ((5, 0, 0), _5__0__X_, 48),
        ((5, 1, 0), _5__1__X_, 48),
    ])
    MAP(items, 'offset_wmEventHandler__area', [
        ((3, 0, 0), _3__4__X_, 56),
        ((3, 5, 0), _3__6__X_, 56),
        ((4, 0, 0), _4__4__X_, 56),
        ((4, 5, 0), _4__5__X_, 56),
        ((5, 0, 0), _5__0__X_, 56),
        ((5, 1, 0), _5__1__X_, 56),
    ])
    MAP(items, 'offset_wmEventHandler__region', [
        ((3, 0, 0), _3__4__X_, 64),
        ((3, 5, 0), _3__6__X_, 64),
        ((4, 0, 0), _4__4__X_, 64),
        ((4, 5, 0), _4__5__X_, 64),
        ((5, 0, 0), _5__0__X_, 64),
        ((5, 1, 0), _5__1__X_, 64),
    ])
    MAP(items, 'offset_wmEventHandler__menu', [
        ((3, 0, 0), _3__4__X_, 72),
        ((3, 5, 0), _3__6__X_, 72),
        ((4, 0, 0), _4__4__X_, 72),
        ((4, 5, 0), _4__5__X_, 72),
        ((5, 0, 0), _5__0__X_, 72),
        ((5, 1, 0), _5__1__X_, 72),
    ])

    MAP(items, 'WM_HANDLER_TYPE_UI', [
        ((3, 0, 0), _3__6__X_, 2),
        ((4, 0, 0), _4__4__X_, 2),
        ((4, 5, 0), _4__5__X_, 2),
        ((5, 0, 0), _5__0__X_, 2),
        ((5, 1, 0), _5__1__X_, 2),
    ])

    # 非 DNA 类型 uiHandleButtonData

    # 获取方法：*(((size_t *)(void *)p) - 1)，不是 sizeof(...)，两者结果有差异
    MAP(items, 'sizeof_uiHandleButtonData', [
        ((3, 0, 0), _3__1__X_, 376),
        ((3, 2, 0), _3__6__X_, 376),
        ((4, 0, 0), _4__1__X_, 376),
        ((4, 2, 0), _4__2__X_, 360),
        ((4, 3, 0), _4__4__X_, 360),
        ((4, 5, 0), _4__5__X_, 731),
        ((5, 0, 0), _5__0__X_, 731),
        ((5, 1, 0), _5__1__X_, 747),
    ])

    MAP(items, 'offset_uiHandleButtonData__region', [
        ((3, 0, 0), _3__6__X_, 24),
        ((4, 0, 0), _4__4__X_, 24),
        ((4, 5, 0), _4__5__X_, 24),
        ((5, 0, 0), _5__0__X_, 24),
        ((5, 1, 0), _5__1__X_, 24),
    ])

    # 非 DNA 类型 uiPopupBlockHandle

    # 获取方法：*(((size_t *)(void *)p) - 1)，不是 sizeof(...)，两者结果有差异
    MAP(items, 'sizeof_uiPopupBlockHandle', [
        ((3, 0, 0), _3__6__X_, 264),
        ((4, 0, 0), _4__4__X_, 328),
        ((4, 5, 0), _4__5__X_, 331),
        ((5, 0, 0), _5__0__X_, 331),
        ((5, 1, 0), _5__1__X_, 329),
    ])

    MAP(items, 'offset_uiPopupBlockHandle__region', [
        ((3, 0, 0), _3__6__X_, 0),
        ((4, 0, 0), _4__4__X_, 0),
        ((4, 5, 0), _4__5__X_, 0),
        ((5, 0, 0), _5__0__X_, 0),
        ((5, 1, 0), _5__1__X_, 0),
    ])

    # 非 DNA 类型 uiBlock

    MAP(items, 'offset_uiBlock__buttons', [
        ((3, 0, 0), _3__3__X_, 16),
        ((3, 4, 0), _3__4__X_, 16),
        ((3, 5, 0), _3__6__X_, 16),
        ((4, 0, 0), _4__0__X_, 16),
        ((4, 1, 0), _4__1__X_, 16),
        ((4, 2, 0), _4__2__X_, 16),
        ((4, 3, 0), _4__4__X_, 16),
        ((4, 5, 0), _4__5__X_, 16),
        ((5, 0, 0), _5__0__X_, 16),
        ((5, 1, 0), _5__1__X_, 16),
    ])

    # 从 Blender 4.5.0 开始需要这些参数：
    # - offset_uiBlock__buttons__begin_
    # - offset_uiBlock__buttons__end_
    # - sizeof_uiBlock__buttons__unique_ptr

    MAP(items, 'offset_uiBlock__buttons__begin_', [
        ((4, 5, 0), _4__5__X_, 0),
        ((5, 0, 0), _5__0__X_, 0),
        ((5, 1, 0), _5__1__X_, 0),
    ])

    MAP(items, 'offset_uiBlock__buttons__end_', [
        ((4, 5, 0), _4__5__X_, 8),
        ((5, 0, 0), _5__0__X_, 8),
        ((5, 1, 0), _5__1__X_, 8),
    ])

    MAP(items, 'sizeof_uiBlock__buttons__unique_ptr', [
        ((4, 5, 0), _4__5__X_, 8),
        ((5, 0, 0), _5__0__X_, 8),
        ((5, 1, 0), _5__1__X_, 8),
    ])

    # 非 DNA 类型 uiBut

    # 从 Blender 4.5.0 开始需要这些参数：
    # - sizeof_uiBut（该值实际上没有被使用，目前只是留作备用）

    MAP(items, 'sizeof_uiBut', [
        ((4, 5, 0), _4__5__X_, 952),
        ((5, 0, 0), _5__0__X_, 888),
        ((5, 1, 0), _5__1__X_, 896),
    ])

    MAP(items, 'offset_uiBut__flag', [
        ((3, 0, 0), _3__0__X_, 24),
        ((3, 1, 0), _3__1__X_, 24),
        ((3, 2, 0), _3__2__X_, 24),
        ((3, 3, 0), _3__3__X_, 24),
        ((3, 4, 0), _3__6__X_, 24),
        ((4, 0, 0), _4__0__X_, 24),
        ((4, 1, 0), _4__1__X_, 24),
        ((4, 2, 0), _4__2__X_, 24),
        ((4, 3, 0), _4__3__X_, 24),
        ((4, 4, 0), _4__4__X_, 24),
        ((4, 5, 0), _4__5__X_, 16),
        ((5, 0, 0), _5__0__X_, 16),
        ((5, 1, 0), _5__1__X_, 16),
    ])

    MAP(items, 'offset_uiBut__type', [
        ((3, 0, 0), _3__0__X_, 32),
        ((3, 1, 0), _3__1__X_, 32),
        ((3, 2, 0), _3__2__X_, 32),
        ((3, 3, 0), _3__3__X_, 32),
        ((3, 4, 0), _3__6__X_, 32),
        ((4, 0, 0), _4__0__X_, 36),
        ((4, 1, 0), _4__1__X_, 36),
        ((4, 2, 0), _4__2__X_, 36),
        ((4, 3, 0), _4__3__X_, 36),
        ((4, 4, 0), _4__4__X_, 36),
        ((4, 5, 0), _4__5__X_, 28),
        ((5, 0, 0), _5__0__X_, 25),
        ((5, 1, 0), _5__1__X_, 25),
    ])

    MAP(items, 'UI_SELECT', [
        ((3, 0, 0), _3__6__X_, (1 << 0)),
        ((4, 0, 0), _4__4__X_, (1 << 0)),
        ((4, 5, 0), _4__5__X_, 1),  # (1 << 0)
        ((5, 0, 0), _5__0__X_, 1),
        ((5, 1, 0), _5__1__X_, 1),
    ])

    MAP(items, 'UI_BTYPE_TEXT', [
        ((3, 0, 0), _3__6__X_, (3 << 9)),
        ((4, 0, 0), _4__4__X_, (3 << 9)),
        ((4, 5, 0), _4__5__X_, 1536),  # (3 << 9)
        ((5, 0, 0), _5__0__X_, 3),
        ((5, 1, 0), _5__1__X_, 3),
    ])

    MAP(items, 'UI_BTYPE_NUM', [
        ((3, 0, 0), _3__6__X_, (6 << 9)),
        ((4, 0, 0), _4__4__X_, (6 << 9)),
        ((4, 5, 0), _4__5__X_, 3072),  # (6 << 9)
        ((5, 0, 0), _5__0__X_, 6),
        ((5, 1, 0), _5__1__X_, 6),
    ])

    MAP(items, 'UI_BTYPE_NUM_SLIDER', [
        ((3, 0, 0), _3__6__X_, (7 << 9)),
        ((4, 0, 0), _4__4__X_, (7 << 9)),
        ((4, 5, 0), _4__5__X_, 3584),  # (7 << 9)
        ((5, 0, 0), _5__0__X_, 7),
        ((5, 1, 0), _5__1__X_, 7),
    ])

    MAP(items, 'UI_BTYPE_SEARCH_MENU', [
        ((3, 0, 0), _3__6__X_, (41 << 9)),
        ((4, 0, 0), _4__4__X_, (41 << 9)),
        ((4, 5, 0), _4__5__X_, 20992),  # (41 << 9)
        ((5, 0, 0), _5__0__X_, 33),
        ((5, 1, 0), _5__1__X_, 33),
    ])

    # DNA 类型 SpaceText、SpaceText_Runtime

    MAP(items, 'offset_SpaceText__runtime', [
        ((3, 0, 0), _3__6__X_, 592),
        ((4, 0, 0), _4__0__X_, 592),
        ((4, 1, 0), _4__4__X_, 592),
        ((4, 5, 0), _4__5__X_, 592),
        ((5, 0, 0), _5__0__X_, 592),
        ((5, 1, 0), _5__1__X_, 592),
    ])

    MAP(items, 'offset_SpaceText_Runtime__lheight_px', [
        ((3, 0, 0), _3__6__X_, 0),
        ((4, 0, 0), _4__0__X_, 0),
        ((4, 1, 0), _4__4__X_, 0),
        ((4, 5, 0), _4__5__X_, 0),
        ((5, 0, 0), _5__0__X_, 0),
        ((5, 1, 0), _5__1__X_, 0),
    ])

    MAP(items, 'offset_SpaceText_Runtime__cwidth_px', [
        ((3, 0, 0), _3__6__X_, 4),
        ((4, 0, 0), _4__0__X_, 4),
        ((4, 1, 0), _4__4__X_, 4),
        ((4, 5, 0), _4__5__X_, 4),
        ((5, 0, 0), _5__0__X_, 4),
        ((5, 1, 0), _5__1__X_, 4),
    ])

    MAP(items, 'offset_SpaceText_Runtime__line_number_display_digits', [
        ((3, 0, 0), _3__6__X_, 40),
        ((4, 0, 0), _4__0__X_, 40),
        ((4, 1, 0), _4__4__X_, 40),
        ((4, 5, 0), _4__5__X_, 40),
        ((5, 0, 0), _5__0__X_, 40),
        ((5, 1, 0), _5__1__X_, 40),
    ])

    MAP(items, 'SpaceText_ver', [
        ((3, 0, 0), _3__6__X_, 1),
        ((4, 0, 0), _4__0__X_, 1),
        ((4, 1, 0), _4__4__X_, 2),
        ((4, 5, 0), _4__5__X_, 2),
        ((5, 0, 0), _5__0__X_, 2),
        ((5, 1, 0), _5__1__X_, 2),
    ])

    # DNA 类型 TextStrip

    # 从 Blender 4.4.0 开始需要这些参数：
    # - offset_Strip__flag
    # - offset_Strip__effectdata
    # - offset_TextVars__cursor_offset
    # - offset_TextVars__selection_start_offset
    # - offset_TextVars__selection_end_offset
    # - SEQ_FLAG_TEXT_EDITING_ACTIVE

    MAP(items, 'offset_Strip__flag', [
        ((4, 4, 0), _4__4__X_, 96),
        ((4, 5, 0), _4__5__X_, 96),
        ((5, 0, 0), _5__0__X_, 96),
        ((5, 1, 0), _5__1__X_, 80),
    ])
    MAP(items, 'offset_Strip__effectdata', [
        ((4, 4, 0), _4__4__X_, 352),
        ((4, 5, 0), _4__5__X_, 352),
        ((5, 0, 0), _5__0__X_, 344),
        ((5, 1, 0), _5__1__X_, 288),
    ])
    MAP(items, 'offset_TextVars__cursor_offset', [
        ((4, 4, 0), _4__4__X_, 632),
        ((4, 5, 0), _4__5__X_, 632),
        ((5, 0, 0), _5__0__X_, 136),
        ((5, 1, 0), _5__1__X_, 136),
    ])
    MAP(items, 'offset_TextVars__selection_start_offset', [
        ((4, 4, 0), _4__4__X_, 636),
        ((4, 5, 0), _4__5__X_, 636),
        ((5, 0, 0), _5__0__X_, 140),
        ((5, 1, 0), _5__1__X_, 140),
    ])
    MAP(items, 'offset_TextVars__selection_end_offset', [
        ((4, 4, 0), _4__4__X_, 640),
        ((4, 5, 0), _4__5__X_, 640),
        ((5, 0, 0), _5__0__X_, 144),
        ((5, 1, 0), _5__1__X_, 144),
    ])

    MAP(items, 'SEQ_FLAG_TEXT_EDITING_ACTIVE', [
        ((4, 4, 0), _4__4__X_, (1 << 6)),
        ((4, 5, 0), _4__5__X_, 64),  # (1 << 6)
        ((5, 0, 0), _5__0__X_, 64),
        ((5, 1, 0), _5__1__X_, 64),
    ])

    return data
